shortest-path-ws/src/test/resources/karate/faultyRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://slaysenfite-shortest-path-service/generated-sources">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:getShortestPathRequest>
            <gen:originPlanetName>Eearth</gen:originPlanetName>
            <gen:destinationPlanetName>Neptune</gen:destinationPlanetName>
        </gen:getShortestPathRequest>
    </soapenv:Body>
</soapenv:Envelope>
