shortest-path-ws/src/test/resources/karate/getShortestPathRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://slaysenfite-shortest-path-service/generated-sources">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:getShortestPathRequest>
            <gen:originPlanetName>Neptune</gen:originPlanetName>
            <gen:destinationPlanetName>Pollux</gen:destinationPlanetName>
        </gen:getShortestPathRequest>
    </soapenv:Body>
</soapenv:Envelope>
